Microchip-MPLAB-Harmony/dev_packs/Microchip/SAML21_DFP/3.3.68/saml21b/edc/ATSAML21E16B.PIC
      <edc:SFRDef edc:_addr="0x40000001" edc:access="-----nnn" edc:cname="SLEEPCFG" edc:impl="0x7" edc:mclr="00000010" edc:nzwidth="0x8" edc:por="00000010" ltx:memberofperipheral="PM">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PM">
            <edc:SFRFieldDef edc:cname="SLEEPMODE" edc:desc="Sleep Mode" edc:nzwidth="0x3">
              <edc:SFRFieldSemantic edc:cname="IDLE" edc:desc="CPU, AHBx, and APBx clocks are OFF" edc:when="(field &amp; 0x7) == 2"/>
              <edc:SFRFieldSemantic edc:cname="STANDBY" edc:desc="All Clocks are OFF" edc:when="(field &amp; 0x7) == 4"/>
              <edc:SFRFieldSemantic edc:cname="BACKUP" edc:desc="Only Backup domain is powered ON" edc:when="(field &amp; 0x7) == 5"/>
              <edc:SFRFieldSemantic edc:cname="OFF" edc:desc="All power domains are powered OFF" edc:when="(field &amp; 0x7) == 6"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40000002" edc:access="n-----nn" edc:cname="PLCFG" edc:impl="0x83" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="PM">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PM">
            <edc:SFRFieldDef edc:cname="PLSEL" edc:desc="Performance Level Select" edc:nzwidth="0x2">
              <edc:SFRFieldSemantic edc:cname="PL0" edc:desc="Performance Level 0" edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="PL1" edc:desc="Performance Level 1" edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="PL2" edc:desc="Performance Level 2" edc:when="(field &amp; 0x3) == 0x2"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x5"/>
            <edc:SFRFieldDef edc:cname="PLDIS" edc:desc="Performance Level Disable" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x40000003" edc:offset="0x1"/>
      <edc:SFRDef edc:_addr="0x40000004" edc:access="-------n" edc:cname="INTENCLR" edc:impl="0x1" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="PM">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PM">
            <edc:SFRFieldDef edc:cname="PLRDY" edc:desc="Performance Level Interrupt Enable" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40000005" edc:access="-------n" edc:cname="INTENSET" edc:impl="0x1" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="PM">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PM">
            <edc:SFRFieldDef edc:cname="PLRDY" edc:desc="Performance Level Ready interrupt Enable" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40000006" edc:access="-------n" edc:cname="INTFLAG" edc:impl="0x1" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="PM">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PM">
            <edc:SFRFieldDef edc:cname="PLRDY" edc:desc="Performance Level Ready" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x40000007" edc:offset="0x1"/>
      <edc:SFRDef edc:_addr="0x40000008" edc:access="nnnnnnnnnnnn--nn" edc:cname="STDBYCFG" edc:impl="0xFFF3" edc:mclr="0000000000000000" edc:nzwidth="0x10" edc:por="0000000000000000" ltx:memberofperipheral="PM">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PM">
            <edc:SFRFieldDef edc:cname="PDCFG" edc:desc="Power Domain Configuration" edc:nzwidth="0x2">
              <edc:SFRFieldSemantic edc:cname="DEFAULT" edc:desc="All power domains switching is handled by hardware." edc:when="(field &amp; 0x3) == 0"/>
              <edc:SFRFieldSemantic edc:cname="PD0" edc:desc="PD0 is forced ACTIVE. PD1 and PD2 power domains switching is handled by hardware." edc:when="(field &amp; 0x3) == 1"/>
              <edc:SFRFieldSemantic edc:cname="PD01" edc:desc="PD0 and PD1 are forced ACTIVE. PD2 power domain switching is handled by hardware." edc:when="(field &amp; 0x3) == 2"/>
              <edc:SFRFieldSemantic edc:cname="PD012" edc:desc="All power domains are forced ACTIVE." edc:when="(field &amp; 0x3) == 3"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="DPGPD0" edc:desc="Dynamic Power Gating for PD0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DPGPD1" edc:desc="Dynamic Power Gating for PD1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="VREGSMOD" edc:desc="Voltage Regulator Standby mode" edc:nzwidth="0x2">
              <edc:SFRFieldSemantic edc:cname="AUTO" edc:desc="Automatic mode" edc:when="(field &amp; 0x3) == 0"/>
              <edc:SFRFieldSemantic edc:cname="PERFORMANCE" edc:desc="Performance oriented" edc:when="(field &amp; 0x3) == 1"/>
              <edc:SFRFieldSemantic edc:cname="LP" edc:desc="Low Power oriented" edc:when="(field &amp; 0x3) == 2"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="LINKPD" edc:desc="Linked Power Domain" edc:nzwidth="0x2">
              <edc:SFRFieldSemantic edc:cname="DEFAULT" edc:desc="Power domains are not linked" edc:when="(field &amp; 0x3) == 0"/>
              <edc:SFRFieldSemantic edc:cname="PD01" edc:desc="PD0 and PD1 power domains are linked" edc:when="(field &amp; 0x3) == 1"/>
              <edc:SFRFieldSemantic edc:cname="PD12" edc:desc="PD1 and PD2 power domains are linked" edc:when="(field &amp; 0x3) == 2"/>
              <edc:SFRFieldSemantic edc:cname="PD012" edc:desc="All power domains are linked" edc:when="(field &amp; 0x3) == 3"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="BBIASHS" edc:desc="Back Bias for HMCRAMCHS" edc:nzwidth="0x2"/>
            <edc:SFRFieldDef edc:cname="BBIASLP" edc:desc="Back Bias for HMCRAMCLP" edc:nzwidth="0x2"/>
            <edc:SFRFieldDef edc:cname="BBIASPP" edc:desc="Back Bias for PicoPram" edc:nzwidth="0x2"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x4000000A" edc:offset="0x2"/>
      <edc:SFRDef edc:_addr="0x4000000C" edc:access="nnnnnnnn" edc:cname="PWSAKDLY" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="PM">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PM">
            <edc:SFRFieldDef edc:cname="DLYVAL" edc:desc="Delay Value" edc:nzwidth="0x7"/>
            <edc:SFRFieldDef edc:cname="IGNACK" edc:desc="Ignore Acknowledge" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x4000000D" edc:offset="0x3F3"/>
      <edc:SFRDef edc:_addr="0x40000400" edc:access="nnnnnnnn" edc:cname="CTRLA" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="MCLK"/>
      <edc:SFRDef edc:_addr="0x40000401" edc:access="-------n" edc:cname="INTENCLR" edc:impl="0x1" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="MCLK">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MCLK">
            <edc:SFRFieldDef edc:cname="CKRDY" edc:desc="Clock Ready Interrupt Enable" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
